&НаКлиенте
Процедура ЗаказыКоличествоПриИзменении(Элемент)
	РассчётСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыЦенаПриИзменении(Элемент)
	РассчётСуммы();
КонецПроцедуры
&НаКлиенте
Процедура РассчётСуммы()
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ТекущийОбъект.Статус = Перечисления.Статус.Закрыт Тогда
		ТекущийЭлемент.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
