
Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("СтарыйРуководитель", Ссылка.Руководитель);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ДополнительныеСвойства.СтарыйРуководитель <>  Руководитель Тогда 
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		Запись = РегистрыСведений.Руководители.СоздатьМенеджерЗаписи();
		Запись.Период = НачалоМесяца(ТекущаяДатаСеанса);
		Запись.Руководитель = Руководитель;
		Запись.Подразделения = Ссылка; 
		Запись.ДатаИзменения = ТекущаяДатаСеанса;
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры
