
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Статус = Перечисления.Статус.Новый;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Статус = Перечисления.Статус.ВРаботе Тогда
		ПроверяемыеРеквизиты.Добавить("Подразделения");
		ПроверяемыеРеквизиты.Добавить("Ответственный");
		ПроверяемыеРеквизиты.Добавить("Заказы");
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутреннийЗаказЗаказы.Ссылка КАК Ссылка,
		|	СУММА(ВнутреннийЗаказЗаказы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ВнутреннийЗаказ.Заказы КАК ВнутреннийЗаказЗаказы
		|ГДЕ
		|	ВнутреннийЗаказЗаказы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнутреннийЗаказЗаказы.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Движения.РегистрТоваров.Записывать = Истина;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.РегистрТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Заказы = ВыборкаДетальныеЗаписи.Ссылка;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
КонецПроцедуры

