
&НаКлиенте
Процедура Руководители(Команда)
	ПолучитьФорму("РегистрСведений.Руководители.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = Истина;
	Сообщить("Закрыть рабочий стол невозможно");
КонецПроцедуры

&НаКлиенте
Процедура Сотрудники(Команда)
	ПолучитьФорму("Справочник.Сотрудники.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура(Команда)
	ПолучитьФорму("Справочник.Номенклатура.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Подразделения(Команда)
	ПолучитьФорму("Справочник.Подразделения.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ВнутреннийЗаказ(Команда)
	ПолучитьФорму("Документ.ВнутреннийЗаказ.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчётПоВнутреннимЗаказам(Команда)
	ПолучитьФорму("Отчет.ОтчётПоВнутреннимЗаказам.Форма").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПерепроведениеДокументов(Команда)
	ПолучитьФорму("Обработка.ПерепроведениеДокументов.Форма").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РегистрТоваров(Команда)
	ПолучитьФорму("РегистрНакопления.РегистрТоваров.ФормаСписка").Открыть();
КонецПроцедуры


