&НаКлиенте
Процедура Перепровести(Команда)    
	Ошибки = Новый  Массив();
	ПерепровестиНаСервере(Ошибки);
	Если Ошибки.Количество() = 0 Тогда 
		ПоказатьПредупреждение(Неопределено, "Документы проведены успешно",,"Успех");
	Иначе
		Сообщить("Есть ошибка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиНаСервере(Ошибки)
 	   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Руководители.Подразделения КАК Подразделения
		|ПОМЕСТИТЬ ВТ_Подразделения
		|ИЗ
		|	РегистрСведений.Руководители КАК Руководители
		|ГДЕ
		|	Руководители.ДатаИзменения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнутреннийЗаказ.Ссылка КАК Документ
		|ИЗ
		|	Документ.ВнутреннийЗаказ КАК ВнутреннийЗаказ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
		|		ПО ВнутреннийЗаказ.Подразделения = ВТ_Подразделения.Подразделения
		|			И (ВнутреннийЗаказ.Проведен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВнутреннийЗаказ.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
		Попытка
				Перепроведение = ВыборкаДетальныеЗаписи.Документ.ПолучитьОбъект();
				Перепроведение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
				ЗаписьЖурналаРегистрации("ВнутреннийДокумент.Перепроведение", 
				УровеньЖурналаРегистрации.Ошибка, ВыборкаДетальныеЗаписи.Документ.Метаданные(), ВыборкаДетальныеЗаписи.Документ);
				Сообщение = Новый  СообщениеПользователю();
				Сообщение.Текст = ТекстОшибки;
				Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры